Revit 2027 API
SpecTypeId.UnitWeight Property
 Unit Weight, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId UnitWeight { get; }
Public Shared ReadOnly Property UnitWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ UnitWeight {
	ForgeTypeId^ get ();
}
static member UnitWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace